# Вывести на экран числа кратные 5 от 0 до 100 включительно.
# Сделать это с помощью функции range c шагом 1 и вложенным if
for num in range(10, 101):
    if num % 5 == 0:
        print(num)
